// - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б
// function square(a, b) {
//
//     // return a*b
//     document.write(a * b)
// }
//
// square(5, 3)
//
//
// // - створити функцію яка обчислює та повертає площу кола з радіусом r
// function radius(r) {
//
//     console.log(Math.PI * r * r)
// }
//
// radius(1)
//
// // - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r
// // 2PI*r*h
// function size(r, h) {
//     document.write(2 * Math.PI * r * h)
// }
//
// size(10, 5)
// //
// // // - створити функцію яка приймає масив та виводить кожен його елемент
// let array = [
//     "vovov", 12, 13, 56, 880, 8 - 9 + 10 - 22
// ]
//
// function masif(arr) {
//     console.log(arr)
// }
//
// masif(array)
//
// // - створити функцію яка створює параграф з текстом. Текст задати через аргумент
// function xxx(text) {
//     document.write(`<p>${text}<p>`)
// }
//
// xxx(`text`);
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
// function ppp(list) {
//     document.write(`<ul>
//         <li>${list}</li>
//         <li>${list}</li>
//         <li>${list}</li>
//         </ul>`)
// }
//     ppp(`list`)

// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)

// function xxx(list,count){
//     document.write(`<ul>`)
//     for (let i=0; i<count; i++){
//         document.write(`<li>${list}</li>`)
//
//     }
//     document.write(`</ul>`)
//
// }
// xxx(`some`, 12)
// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.
// - створити функцію яка повертає найменьше число з масиву
// - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13